Revit 2027 API
BuiltInFailures.SketchFailures.SketchOverconstrained Property
 Sketch is overconstrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SketchOverconstrained { get; }
Public Shared ReadOnly Property SketchOverconstrained As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SketchOverconstrained {
	FailureDefinitionId^ get ();
}
static member SketchOverconstrained : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace